UTS_CI/app/Controllers/MahasiswaController.php

SELECT *
FROM `prodi`
---
    public function fetchOption()
    {
        $model = new \App\Models\ProdiModel();
        $prodi = $model->findAll();