UTS_CI/app/Controllers/ProdiController.php

SELECT *
FROM `prodi`
---
    public function fetch()
    {
        $model = new \App\Models\ProdiModel();
        $prodi = $model->findAll();