UTS_CI/app/Models/MahasiswaModel.php

SELECT *
FROM `mahasiswa`
JOIN `prodi` ON `prodi`.`id_prodi`=`mahasiswa`.`prodi_mahasiswa`
---
    public function getJoinedMahasiswa()
    {
        return $this->db->table('mahasiswa')
            ->join('prodi', 'prodi.id_prodi=mahasiswa.prodi_mahasiswa')
            ->get()->getResultArray();